# **Atividade Prática 01 - Tabela raw e consultas SQL**

Objetivo: A partir de um banco de dados em PostgreSQL com várias Tabelas criar uma Tabela Raw para ser usada no processo de Ciência dos Dados.

Tarefas:
- Criar o ambiente de trabalho (instalar PostgreSQL, Python, Anaconda)
- Criar a base de dados de exemplo em PostgreSQL usando um backup de uma base de dados pronta (arquivos).
- Acessar ao banco de dados em PostgreSQL usando consultas com níveis de complexidade básico até complexo para preencher um arquivo .csv usando as bibliotecas Panda, psycopg2 e sqlalchemy

Testar as seguintes consultas:
1. Os 10 produtos mais caros
select distinct products.productname as tenmostexpensiveproducts, products.unitprice from products order by products.unitprice desc;

2. Pedido trimestral
select customers.customerid, customers.companyname, customers.city, customers.country
from customers right join orders on customers.customerid = orders.customerid
where (((orders.orderdate) between #1/1/1995# and #12/31/1995#));

3. Detalhes do pedido estendido
select distinctrow [order details].orderid, [order details].productid, products.productname, [order details].unitprice, [order details].quantity, [order details].discount, ccur([order details].[unitprice]*[quantity]*(1-[discount])/100)*100 as extendedprice
from products inner join [order details] on products.productid = [order details].productid
order by [order details].orderid;

4. Produtos por baixo do valor médio
select distinctrow products.productname, products.unitprice
from products
where (((products.unitprice)>(select avg([unitprice]) from products)))
order by products.unitprice desc;

5. Subtotal do pedido
select distinctrow [order details].orderid, sum(ccur([unitprice]*[quantity]*(1-[discount])/100)*100) as subtotal
from [order details]
group by [order details].orderid;

6. Vendas por ano (trabalho em equipe)

7. Produtos vendidos em 1995 (trabalho em equipe)

8. Vendas por Categoria (trabalho em equipe)

## Ambiente de Trabalho

### Instalação e inicialização do postgres

In [1]:
# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76, <> line 11.)
debconf: falling back to frontend: Readline
debconf: unable to initialize frontend: Readline
debconf: (This frontend requires a controlling tty.)
debconf: falling back to frontend: Teletype
dpkg-preconfigure: unable to re-open stdin:
Selecting previously unselected package cron.
(Reading database ... 144793 files and directories currently installed.)
Preparing to unpack .../00-cron_3.0pl1-128.1ubuntu1_amd64.deb ...
Unpacking cron (3.0pl1-128.1ubuntu1) ...
Selecting previously unselected package logrotate.
Preparing to unpack .../01-logrotate_3.11.0-0.1ubuntu1_amd64.deb ...
Unpacking logrotate (3.11.0-0.1ubuntu1) ...
Selecting previously unselected package netbase.
Preparing to unpack .../02-netbase_5.4_all.deb ...
Unpacking netbase (5.4) ...
Preparing to unpack .../03-libpq5_10.15-0ubuntu0.18.04.1_amd64.deb ...
Unpacking libpq5:amd64 (10.15-0ubuntu0.18.04.1) over (10.14-0ubuntu0.18.04.1) ...
Selecting previously unselected package postgresql-client-common.
Preparing to unpack .../04-postgresql-client-common_190ubuntu0.1_all.deb ...
Unpacking postgresql-client-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-client-10.
Preparing to unpack .../05-postgresql-client-10_10.15-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-client-10 (10.15-0ubuntu0.18.04.1) ...
Selecting previously unselected package ssl-cert.
Preparing to unpack .../06-ssl-cert_1.0.39_all.deb ...
Unpacking ssl-cert (1.0.39) ...
Selecting previously unselected package postgresql-common.
Preparing to unpack .../07-postgresql-common_190ubuntu0.1_all.deb ...
Adding 'diversion of /usr/bin/pg_config to /usr/bin/pg_config.libpq-dev by postgresql-common'
Unpacking postgresql-common (190ubuntu0.1) ...
Selecting previously unselected package postgresql-10.
Preparing to unpack .../08-postgresql-10_10.15-0ubuntu0.18.04.1_amd64.deb ...
Unpacking postgresql-10 (10.15-0ubuntu0.18.04.1) ...
Selecting previously unselected package postgresql.
Preparing to unpack .../09-postgresql_10+190ubuntu0.1_all.deb ...
Unpacking postgresql (10+190ubuntu0.1) ...
Selecting previously unselected package sysstat.
Preparing to unpack .../10-sysstat_11.6.1-1ubuntu0.1_amd64.deb ...
Unpacking sysstat (11.6.1-1ubuntu0.1) ...
Setting up sysstat (11.6.1-1ubuntu0.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline

Creating config file /etc/default/sysstat with new version
update-alternatives: using /usr/bin/sar.sysstat to provide /usr/bin/sar (sar) in auto mode
Created symlink /etc/systemd/system/multi-user.target.wants/sysstat.service → /lib/systemd/system/sysstat.service.
Setting up ssl-cert (1.0.39) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Setting up libpq5:amd64 (10.15-0ubuntu0.18.04.1) ...
Setting up cron (3.0pl1-128.1ubuntu1) ...
Adding group `crontab' (GID 110) ...
Done.
Created symlink /etc/systemd/system/multi-user.target.wants/cron.service → /lib/systemd/system/cron.service.
update-rc.d: warning: start and stop actions are no longer supported; falling back to defaults
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up logrotate (3.11.0-0.1ubuntu1) ...
Setting up netbase (5.4) ...
Setting up postgresql-client-common (190ubuntu0.1) ...
Setting up postgresql-common (190ubuntu0.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Adding user postgres to group ssl-cert

Creating config file /etc/postgresql-common/createcluster.conf with new version
Building PostgreSQL dictionaries from installed myspell/hunspell packages...
Removing obsolete dictionary files:
Created symlink /etc/systemd/system/multi-user.target.wants/postgresql.service → /lib/systemd/system/postgresql.service.
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql-client-10 (10.15-0ubuntu0.18.04.1) ...
update-alternatives: using /usr/share/postgresql/10/man/man1/psql.1.gz to provide /usr/share/man/man1/psql.1.gz (psql.1.gz) in auto mode
Setting up postgresql-10 (10.15-0ubuntu0.18.04.1) ...
debconf: unable to initialize frontend: Dialog
debconf: (No usable dialog-like program is installed, so the dialog based frontend cannot be used. at /usr/share/perl5/Debconf/FrontEnd/Dialog.pm line 76.)
debconf: falling back to frontend: Readline
Creating new PostgreSQL cluster 10/main ...
/usr/lib/postgresql/10/bin/initdb -D /var/lib/postgresql/10/main --auth-local peer --auth-host md5
The files belonging to this database system will be owned by user "postgres".
This user must also own the server process.

The database cluster will be initialized with locale "en_US.UTF-8".
The default database encoding has accordingly been set to "UTF8".
The default text search configuration will be set to "english".

Data page checksums are disabled.

fixing permissions on existing directory /var/lib/postgresql/10/main ... ok
creating subdirectories ... ok
selecting default max_connections ... 100
selecting default shared_buffers ... 128MB
selecting default timezone ... Etc/UTC
selecting dynamic shared memory implementation ... posix
creating configuration files ... ok
running bootstrap script ... ok
performing post-bootstrap initialization ... ok
syncing data to disk ... ok

Success. You can now start the database server using:

    /usr/lib/postgresql/10/bin/pg_ctl -D /var/lib/postgresql/10/main -l logfile start

Ver Cluster Port Status Owner    Data directory              Log file
10  main    5432 down   postgres /var/lib/postgresql/10/main /var/log/postgresql/postgresql-10-main.log
update-alternatives: using /usr/share/postgresql/10/man/man1/postmaster.1.gz to provide /usr/share/man/man1/postmaster.1.gz (postmaster.1.gz) in auto mode
invoke-rc.d: could not determine current runlevel
invoke-rc.d: policy-rc.d denied execution of start.
Setting up postgresql (10+190ubuntu0.1) ...
Processing triggers for man-db (2.8.3-2ubuntu0.1) ...
Processing triggers for libc-bin (2.27-3ubuntu1.2) ...
/sbin/ldconfig.real: /usr/local/lib/python3.6/dist-packages/ideep4py/lib/libmkldnn.so.0 is not a symbolic link

Processing triggers for systemd (237-3ubuntu10.42) ...
 * Starting PostgreSQL 10 database server
   ...done.

### Criação de usuário e database

In [2]:
# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

# Setup a database with name `enterprise` to be used
!sudo -u postgres psql -U postgres -c 'DROP DATABASE IF EXISTS enterprise;'
!sudo -u postgres psql -U postgres -c 'CREATE DATABASE enterprise;'

ALTER ROLE
NOTICE:  database "enterprise" does not exist, skipping
DROP DATABASE
CREATE DATABASE

### Montagem de drive para upload de arquivo sql

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

### Importação do arquivo para o schema/database

Para facilitar a importação da estrutura e dos dados (DDL), vamos criar variáveis de ambiente

In [4]:
%env APE_DATABASE_NAME=enterprise
%env APE_DATABASE_HOST=localhost
%env APE_DATABASE_PORT=5432
%env APE_DATABASE_USER=postgres
%env APE_DATABASE_PASS=postgres

env: APE_DATABASE_NAME=enterprise
env: APE_DATABASE_HOST=localhost
env: APE_DATABASE_PORT=5432
env: APE_DATABASE_USER=postgres
env: APE_DATABASE_PASS=postgres

A importação utilizando as variáveis criadas anteriormente

In [5]:
!PGPASSWORD=$APE_DATABASE_PASS psql -q -h $APE_DATABASE_HOST -p $APE_DATABASE_PORT -U $APE_DATABASE_USER -d $APE_DATABASE_NAME -f '/content/drive/MyDrive/Aquisição, Pré-processamento e Exploração de Dados/northwind.sql'

### Conexão com o postgresql

In [6]:
# set connection
%load_ext sql
%config SqlMagic.feedback=False 
%config SqlMagic.autopandas=True
%sql postgresql+psycopg2://postgres:postgres@localhost/enterprise

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: postgres@enterprise'

## Consultas ao Banco de Dados

### 1.Os 10 produtos mais caros

In [ ]:
%sql select distinct products.product_name as tenmostexpensiveproducts, products.unit_price from products order by products.unit_price desc limit 10;

 * postgresql+psycopg2://postgres:***@localhost/enterprise

  tenmostexpensiveproducts  unit_price
0            Côte de Blaye      263.50
1  Thüringer Rostbratwurst      123.79
2          Mishi Kobe Niku       97.00
3   Sir Rodney's Marmalade       81.00
4         Carnarvon Tigers       62.50
5     Raclette Courdavault       55.00
6    Manjimup Dried Apples       53.00
7           Tarte au sucre       49.30
8              Ipoh Coffee       46.00
9        Rössle Sauerkraut       45.60

### 2.Pedido trimestral

In [ ]:
%%sql select orders.order_date, customers.customer_id, customers.company_name, customers.city, customers.country 
from customers right join orders on customers.customer_id = orders.customer_id 
where orders.order_date between to_date('01/01/1996', 'dd/MM/yyyy') and to_date('31/12/1996','dd/MM/yyyy');

 * postgresql+psycopg2://postgres:***@localhost/enterprise

     order_date customer_id  ...            city    country
0    1996-07-04       VINET  ...           Reims     France
1    1996-07-05       TOMSP  ...         Münster    Germany
2    1996-07-08       HANAR  ...  Rio de Janeiro     Brazil
3    1996-07-08       VICTE  ...            Lyon     France
4    1996-07-09       SUPRD  ...       Charleroi    Belgium
..          ...         ...  ...             ...        ...
147  1996-12-26       HILAA  ...   San Cristóbal  Venezuela
148  1996-12-27       FRANK  ...         München    Germany
149  1996-12-27       PRINI  ...          Lisboa   Portugal
150  1996-12-30       SAVEA  ...           Boise        USA
151  1996-12-31       VAFFE  ...           Århus    Denmark

[152 rows x 5 columns]

### 3.Detalhes do pedido estendido

In [ ]:
%%sql select distinct order_details.order_id, order_details.product_id, products.product_name, 
order_details.unit_price, order_details.quantity, order_details.discount, (order_details.unit_price*quantity*((1-discount)/100))*100::double precision::numeric::money as extendedprice 
from products inner join order_details on products.product_id = order_details.product_id order by order_details.order_id;

 * postgresql+psycopg2://postgres:***@localhost/enterprise

      order_id  product_id  ... discount  extendedprice
0        10248          11  ...     0.00        $168.00
1        10248          42  ...     0.00         $98.00
2        10248          72  ...     0.00        $174.00
3        10249          14  ...     0.00        $167.40
4        10249          51  ...     0.00      $1,696.00
...        ...         ...  ...      ...            ...
2150     11077          64  ...     0.03         $64.51
2151     11077          66  ...     0.00         $17.00
2152     11077          73  ...     0.01         $29.70
2153     11077          75  ...     0.00         $31.00
2154     11077          77  ...     0.00         $26.00

[2155 rows x 7 columns]

### 4.Produtos por baixo do valor médio

In [ ]:
%%sql select distinct products.product_name, products.unit_price 
from products where (((products.unit_price)<(select avg(products.unit_price) from products))) order by products.unit_price desc;

 * postgresql+psycopg2://postgres:***@localhost/enterprise

                        product_name  unit_price
0                     Sirop d'érable       28.50
1                         Gravad lax       26.00
2              Nord-Ost Matjeshering       25.89
3       Grandma's Boysenberry Spread       25.00
4                       Pâté chinois       24.00
5                               Tofu       23.25
6       Chef Anton's Cajun Seasoning       22.00
7                        Flotemysost       21.50
8             Chef Anton's Gumbo Mix       21.35
9   Louisiana Fiery Hot Pepper Sauce       21.05
10               Gustaf's Knäckebröd       21.00
11                    Queso Cabrales       21.00
12                          Maxilaku       20.00
13                    Ravioli Angelo       19.50
14                      Gula Malacca       19.45
15                             Chang       19.00
16                       Inlagd Sill       19.00
17                  Boston Crab Meat       18.40
18                              Chai       18.00
19                  Chartreuse verte       18.00
20                      Lakkalikööri       18.00
21                    Steeleye Stout       18.00
22                           Pavlova       17.45
23         Louisiana Hot Spiced Okra       17.00
24                  Valkoinen suklaa       16.25
25                     Outback Lager       15.00
26                        Röd Kaviar       15.00
27         Laughing Lumberjack Lager       14.00
28           NuNuCa Nuß-Nougat-Creme       14.00
29                     Sasquatch Ale       14.00
30     Singaporean Hokkien Fried Mee       14.00
31            Escargots de Bourgogne       13.25
32                      Genen Shouyu       13.00
33   Original Frankfurter grüne Soße       13.00
34                         Chocolade       12.75
35                 Gorgonzola Telino       12.50
36               Scottish Longbreads       12.50
37                         Spegesild       12.00
38                     Aniseed Syrup       10.00
39                     Longlife Tofu       10.00
40               Sir Rodney's Scones       10.00
41   Jack's New England Clam Chowder        9.65
42                       Rogede sild        9.50
43                     Zaanse koeken        9.50
44        Teatime Chocolate Biscuits        9.20
45                          Tunnbröd        9.00
46              Rhönbräu Klosterbier        7.75
47                         Tourtière        7.45
48                          Filo Mix        7.00
49                             Konbu        6.00
50                Guaraná Fantástica        4.50
51                           Geitost        2.50

### 5.Subtotal do pedido

In [ ]:
 %%sql select distinct order_details.order_id, sum((unit_price*quantity*((1-discount)/100))*100::double precision::numeric::money) as subtotal 
 from order_details group by order_details.order_id;

 * postgresql+psycopg2://postgres:***@localhost/enterprise

     order_id   subtotal
0       10248    $440.00
1       10249  $1,863.40
2       10250  $1,552.60
3       10251    $654.06
4       10252  $3,597.90
..        ...        ...
825     11073    $300.00
826     11074    $232.09
827     11075    $498.10
828     11076    $792.75
829     11077  $1,255.72

[830 rows x 2 columns]

### 6.Vendas por ano

In [7]:
df_vendas_ano = %%sql select distinct extract(year from order_date) as year, count(distinct orders.order_id) as qtd_orders, \
sum(order_details.unit_price*quantity*((1-discount)/100))*100::double precision::numeric::money as total_amount \
from orders inner join order_details on orders.order_id = order_details.order_id \
group by extract(year from order_date) order by year;

df_vendas_ano

 * postgresql+psycopg2://postgres:***@localhost/enterprise

     year  qtd_orders total_amount
0  1996.0         152  $208,083.97
1  1997.0         408  $617,085.20
2  1998.0         270  $440,623.87

In [8]:
#Armazenando em csv
df_vendas_ano.to_csv('06_orders_by_year.csv')

### 7.Produtos vendidos em 1996

In [9]:
df_vendas_ano_96 = %%sql select distinct products.product_name \
from products inner join order_details on order_details.product_id = products.product_id \
inner join orders on orders.order_id = order_details.order_id \
where extract (year from orders.order_date) = 1996;

df_vendas_ano_96

 * postgresql+psycopg2://postgres:***@localhost/enterprise

                       product_name
0                      Alice Mutton
1                     Aniseed Syrup
2                  Boston Crab Meat
3                 Camembert Pierrot
4                  Carnarvon Tigers
..                              ...
69  Uncle Bob's Organic Dried Pears
70                 Valkoinen suklaa
71                     Vegie-spread
72        Wimmers gute Semmelknödel
73                    Zaanse koeken

[74 rows x 1 columns]

In [10]:
#Armazenando em csv
df_vendas_ano_96.to_csv('07_orders_year_96.csv')

### 8.Vendas por Categoria

In [11]:
df_vendas_categoria = %%sql select distinct categories.category_name, count(orders.order_id) as qtd_orders, \
sum((order_details.unit_price*quantity*((1-discount)/100))*100::double precision::numeric::money) as total_amount \
from categories inner join products on categories.category_id = products.category_id \
inner join order_details on order_details.product_id = products.product_id \
inner join orders on orders.order_id = order_details.order_id \
group by categories.category_name order by total_amount desc;

df_vendas_categoria

 * postgresql+psycopg2://postgres:***@localhost/enterprise

    category_name  qtd_orders total_amount
0       Beverages         404  $267,868.16
1  Dairy Products         366  $234,507.26
2     Confections         334  $167,357.19
3    Meat/Poultry         173  $163,022.37
4         Seafood         330  $131,261.71
5      Condiments         216  $106,047.09
6         Produce         136   $99,984.57
7  Grains/Cereals         196   $95,744.58

In [12]:
#Armazenando em csv
df_vendas_categoria.to_csv('08_orders_by_category.csv')

## Referências
- https://stackoverflow.com/questions/17274961/how-to-map-a-postgres-money-column-in-ms-access